SQL is a standard language for storing, manipulating and retrieving data in databases.

Our SQL tutorial will teach you how to use SQL in: MySQL, SQL Server, MS Access, Oracle, Sybase, Informix, Postgres, and other database systems.

SQL is a standard language for accessing and manipulating databases.

What is SQL?

SQL stands for Structured Query Language

SQL lets you access and manipulate databases
SQL became a standard of the American National Standards Institute (ANSI) in 1986, and of the International Organization for Standardization (ISO) in 1987

What Can SQL do?

SQL can execute queries against a database
SQL can retrieve data from a database
SQL can insert records in a database
SQL can update records in a database
SQL can delete records from a database
SQL can create new databases
SQL can create new tables in a database
SQL can create stored procedures in a database
SQL can create views in a database
SQL can set permissions on tables, procedures, and views

RDBMS

RDBMS stands for Relational Database Management System.

RDBMS is the basis for SQL, and for all modern database systems such as MS SQL Server, IBM DB2, Oracle, MySQL, and Microsoft Access.

The data in RDBMS is stored in database objects called tables. A table is a collection of related data entries and it consists of columns and rows.

Every table is broken up into smaller entities called fields.

A field is a column in a table that is designed to maintain specific information about every record in the table.

A record, also called a row, is each individual entry that exists in a table.

A record is a horizontal entity in a table.

A column is a vertical entity in a table that contains all information associated with a specific field in a table.

Database Tables

A database most often contains one or more tables. Each table is identified by a name (e.g. "Customers" or "Orders"), and contain records (rows) with data.

Keep in Mind That...

SQL keywords are NOT case sensitive: select is the same as SELECT

Semicolon after SQL Statements?

Some database systems require a semicolon at the end of each SQL statement.

Semicolon is the standard way to separate each SQL statement in database systems that allow more than one SQL statement to be executed in the same call to the server.

Some of The Most Important SQL Commands
SELECT - extracts data from a database
UPDATE - updates data in a database
DELETE - deletes data from a database
INSERT INTO - inserts new data into a database
CREATE DATABASE - creates a new database
ALTER DATABASE - modifies a database
CREATE TABLE - creates a new table
ALTER TABLE - modifies a table
DROP TABLE - deletes a table
CREATE INDEX - creates an index (search key)
DROP INDEX - deletes an index

SQL SELECT Statement

The SQL SELECT Statement

The SELECT statement is used to select data from a database.

Syntax
SELECT column1, column2, ...
FROM table_name;

Here, column1, column2, ... are the field names of the table you want to select data from.

The table_name represents the name of the table you want to select data from.


Return data from the Customers table:

SELECT CustomerName, City
FROM Customers;

Select ALL columns
If you want to return all columns, without specifying every column name, you can use the SELECT * syntax:

Example
Return all the columns from the Sales table:

SELECT * 
FROM Sales;

The SQL SELECT DISTINCT Statement

The SELECT DISTINCT statement is used to return only distinct (different) values.

Syntax

SELECT DISTINCT column1, column2, ...
FROM table_name;

Select all the different countries from the "Customers" table:

SELECT DISTINCT Country 
FROM Customers;


Inside a table, a column often contains many duplicate values; and sometimes you only want to list the different (distinct) values.

Count Distinct

By using the DISTINCT keyword in a function called COUNT, we can return the number of different countries.

SELECT COUNT(DISTINCT Country)
FROM Customers;

The SQL WHERE Clause

The WHERE clause is used to filter records.

It is used to extract only those records that fulfill a specified condition.

Text Fields vs. Numeric Fields

SQL requires single quotes around text values (most database systems will also allow double quotes).

However, numeric fields should not be enclosed in quotes:

The following operators can be used in the WHERE clause:

Operator	Description	Example
=	        Equal	
>	        Greater than	
<	        Less than	
>=	        Greater than or equal	
<=	        Less than or equal	
<>	        Not equal. Note: In some versions of SQL this operator may be written as !=	
BETWEEN	    Between a certain range	
LIKE	    Search for a pattern	
IN	        To specify multiple possible values for a column

The SQL ORDER BY

The ORDER BY keyword is used to sort the result-set in ascending or descending order.

Sort the products by price:

SELECT *
FROM customers
ORDER BY customer_id;

Syntax

SELECT column1, column2, ...
FROM table_name
ORDER BY column1, column2, ... ASC|DESC;

DESC

The ORDER BY keyword sorts the records in ascending order by default. To sort the records in descending order, use the DESC keyword.

Sort the products from highest to lowest price:

SELECT * 
FROM Products
ORDER BY Price DESC;

The SQL AND Operator

The WHERE clause can contain one or many AND operators.

The AND operator is used to filter records based on more than one condition, like if you want to return all customers from Spain that starts with the letter 'G':

Select all customers from Spain that starts with the letter 'G':

SELECT *
FROM Customers
WHERE Country = 'Spain' AND CustomerName LIKE 'G%';

Syntax

SELECT column1, column2, ...
FROM table_name
WHERE condition1 AND condition2 AND condition3 ...;

AND vs OR

The AND operator displays a record if all the conditions are TRUE.

The OR operator displays a record if any of the conditions are TRUE.

The SQL OR Operator

The WHERE clause can contain one or more OR operators.

The OR operator is used to filter records based on more than one condition, like if you want to return all customers from Germany but also those from Spain:

Syntax

SELECT column1, column2, ...
FROM table_name
WHERE condition1 OR condition2 OR condition3 ...;

At Least One Condition Must Be True

The following SQL statement selects all fields from Customers where either City is "Berlin", CustomerName starts with the letter "G" or Country is "Norway":

SELECT * 
FROM Customers
WHERE City = 'Berlin' OR CustomerName LIKE 'G%' OR Country = 'Norway';

Combining AND and OR

You can combine the AND and OR operators.

The following SQL statement selects all customers from Spain that starts with a "G" or an "R".

Make sure you use parenthesis to get the correct result.

* Select all Spanish customers that starts with either "G" or "R":

SELECT * 
FROM Customers
WHERE Country = 'Spain' AND (CustomerName LIKE 'G%' OR CustomerName LIKE 'R%');

The NOT Operator

The NOT operator is used in combination with other operators to give the opposite result, also called the negative result.

In the select statement below we want to return all customers that are NOT from Spain:

* Select only the customers that are NOT from Spain:

SELECT * 
FROM Customers
WHERE NOT Country = 'Spain';

Syntax

SELECT column1, column2, ...
FROM table_name
WHERE NOT condition;

NOT LIKE

# Select customers that does not start with the letter 'A':

SELECT * FROM Customers
WHERE CustomerName NOT LIKE 'A%';

NOT BETWEEN

# Select customers with a customerID not between 10 and 60:

SELECT * FROM Customers
WHERE CustomerID NOT BETWEEN 10 AND 60;

NOT IN

# Select customers that are not from Paris or London:

SELECT * FROM Customers
WHERE City NOT IN ('Paris', 'London');

NOT Greater Than

# Select customers with a CustomerId not greater than 50:

SELECT * 
FROM Customers
WHERE NOT CustomerID > 50;

NOT Less Than

# Select customers with a CustomerID not less than 50:

SELECT * FROM Customers
WHERE NOT CustomerId < 50;

SQL INSERT INTO Statement

The SQL INSERT INTO Statement

The INSERT INTO statement is used to insert new records in a table.

INSERT INTO Syntax

It is possible to write the INSERT INTO statement in two ways:

1. Specify both the column names and the values to be inserted:

INSERT INTO table_name (column1, column2, column3, ...)
VALUES (value1, value2, value3, ...);

2. If you are adding values for all the columns of the table, you do not need to specify the column names in the SQL query. However, make sure the order of the values is in the same order as the columns in the table. Here, the INSERT INTO syntax would be as follows:

INSERT INTO table_name
VALUES (value1, value2, value3, ...);

INSERT INTO Example

The following SQL statement inserts a new record in the "Customers" table:

INSERT INTO Customers (CustomerName, ContactName, Address, City, PostalCode, Country)
VALUES ('Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway');

Insert Data Only in Specified Columns

It is also possible to only insert data in specific columns.

# The following SQL statement will insert a new record, but only insert data in the "CustomerName", "City", and "Country" columns (CustomerID will be updated automatically):

INSERT INTO Customers (CustomerName, City, Country)
VALUES ('Cardinal', 'Stavanger', 'Norway');

Insert Multiple Rows

It is also possible to insert multiple rows in one statement.

To insert multiple rows of data, we use the same INSERT INTO statement, but with multiple values:

# Example

INSERT INTO Customers (CustomerName, ContactName, Address, City, PostalCode, Country)
VALUES
('Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway'),
('Greasy Burger', 'Per Olsen', 'Gateveien 15', 'Sandnes', '4306', 'Norway'),
('Tasty Tee', 'Finn Egan', 'Streetroad 19B', 'Liverpool', 'L1 0AA', 'UK');

SQL NULL Values

What is a NULL Value?

A field with a NULL value is a field with no value.

If a field in a table is optional, it is possible to insert a new record or update a record without adding a value to this field. Then, the field will be saved with a NULL value.

Note: A NULL value is different from a zero value or a field that contains spaces. A field with a NULL value is one that has been left blank during record creation!

How to Test for NULL Values?

It is not possible to test for NULL values with comparison operators, such as =, <, or <>.

We will have to use the IS NULL and IS NOT NULL operators instead.

IS NULL Syntax

SELECT column_names
FROM table_name
WHERE column_name IS NULL;

IS NOT NULL Syntax

SELECT column_names
FROM table_name
WHERE column_name IS NOT NULL;

The IS NULL Operator

The IS NULL operator is used to test for empty values (NULL values).

# The following SQL lists all customers with a NULL value in the "Address" field:

SELECT CustomerName, ContactName, Address
FROM Customers
WHERE Address IS NULL;

NOTE: Always use IS NULL to look for NULL values.

The IS NOT NULL Operator

The IS NOT NULL operator is used to test for non-empty values (NOT NULL values).

# The following SQL lists all customers with a value in the "Address" field:

SELECT CustomerName, ContactName, Address
FROM Customers
WHERE Address IS NOT NULL;

SQL UPDATE Statement

The SQL UPDATE Statement

The UPDATE statement is used to modify the existing records in a table.

UPDATE Syntax

UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition;

Note: Be careful when updating records in a table! Notice the WHERE clause in the UPDATE statement. The WHERE clause specifies which record(s) that should be updated. If you omit the WHERE clause, all records in the table will be updated!

UPDATE Table

# The following SQL statement updates the first customer (CustomerID = 1) with a new contact person and a new city.

UPDATE Customers
SET ContactName = 'Alfred Schmidt', City= 'Frankfurt'
WHERE CustomerID = 1;

UPDATE Multiple Records
It is the WHERE clause that determines how many records will be updated.

# The following SQL statement will update the ContactName to "Juan" for all records where country is "Mexico":

UPDATE Customers
SET ContactName='Juan'
WHERE Country='Mexico';

Update Warning!

Be careful when updating records. If you omit the WHERE clause, ALL records will be updated!


# e.g 

UPDATE Customers
SET ContactName='Juan';

SQL DELETE Statement

The SQL DELETE Statement

The DELETE statement is used to delete existing records in a table.

DELETE Syntax

DELETE FROM table_name
WHERE condition;

Note: Be careful when deleting records in a table! Notice the WHERE clause in the DELETE statement. The WHERE clause specifies which record(s) should be deleted. If you omit the WHERE clause, all records in the table will be deleted!

SQL DELETE Example

# The following SQL statement deletes the customer "Alfreds Futterkiste" from the "Customers" table:
DELETE FROM Customers 
WHERE CustomerName='Alfreds Futterkiste';

Delete All Records

It is possible to delete all rows in a table without deleting the table. This means that the table structure, attributes, and indexes will be intact:

DELETE FROM table_name;

# The following SQL statement deletes all rows in the "Customers" table, without deleting the table:

DELETE FROM Customers;

Delete a Table

To delete the table completely, use the DROP TABLE statement:

# Remove the Customers table:

DROP TABLE Customers;

SQL TOP, LIMIT, FETCH FIRST or ROWNUM Clause

The SQL SELECT TOP Clause

The SELECT TOP clause is used to specify the number of records to return.

The SELECT TOP clause is useful on large tables with thousands of records. Returning a large number of records can impact performance.

Note: Not all database systems support the SELECT TOP clause. 

MySQL supports the LIMIT clause to select a limited number of records, while Oracle uses FETCH FIRST n ROWS ONLY and ROWNUM.

SQL Server / MS Access Syntax:

SELECT TOP number|percent column_name(s)
FROM table_name
WHERE condition;

MySQL Syntax:

SELECT column_name(s)
FROM table_name
WHERE condition
LIMIT number;

Oracle 12 Syntax:

SELECT column_name(s)
FROM table_name
ORDER BY column_name(s)
FETCH FIRST number ROWS ONLY;

Older Oracle Syntax:

SELECT column_name(s)
FROM table_name
WHERE ROWNUM <= number;

Older Oracle Syntax (with ORDER BY):

SELECT *
FROM (SELECT column_name(s) FROM table_name ORDER BY column_name(s))
WHERE ROWNUM <= number;

LIMIT
The following SQL statement shows the equivalent example for MySQL:

# Select the first 3 records of the Customers table:

SELECT * 
FROM Customers
LIMIT 3;

FETCH FIRST

The following SQL statement shows the equivalent example for Oracle:

# Example
Select the first 3 records of the Customers table:

SELECT * 
FROM Customers
FETCH FIRST 3 ROWS ONLY;

SQL TOP PERCENT Example

The following SQL statement selects the first 50% of the records from the "Customers" table (for SQL Server/MS Access):

# Example
SELECT TOP 50 PERCENT * 
FROM Customers;

The following SQL statement shows the equivalent example for Oracle:

# Example
SELECT * 
FROM Customers
FETCH FIRST 50 PERCENT ROWS ONLY;

ADD a WHERE CLAUSE
The following SQL statement selects the first three records from the "Customers" table, where the country is "Germany" (for SQL Server/MS Access):

# Example
SELECT TOP 3 * 
FROM Customers
WHERE Country = 'Germany';

The following SQL statement shows the equivalent example for MySQL:

# Example

SELECT * 
FROM Customers
WHERE Country='Germany'
LIMIT 3;

The following SQL statement shows the equivalent example for Oracle:

# Example
SELECT * 
FROM Customers
WHERE Country='Germany'
FETCH FIRST 3 ROWS ONLY;

ADD the ORDER BY Keyword

Add the ORDER BY keyword when you want to sort the result, and return the first 3 records of the sorted result.

For SQL Server and MS Access:

# Example
Sort the result reverse alphabetically by CustomerName, and return the first 3 records:

SELECT TOP 3 * 
FROM Customers
ORDER BY CustomerName DESC;

The following SQL statement shows the equivalent example for MySQL:

# Example

SELECT * 
FROM Customers
ORDER BY CustomerName DESC
LIMIT 3;

The following SQL statement shows the equivalent example for Oracle:

# Example

SELECT * 
FROM Customers
ORDER BY CustomerName DESC
FETCH FIRST 3 ROWS ONLY;

SQL Aggregate Functions

SQL Aggregate Functions
An aggregate function is a function that performs a calculation on a set of values, and returns a single value.

Aggregate functions are often used with the GROUP BY clause of the SELECT statement. The GROUP BY clause splits the result-set into groups of values and the aggregate function can be used to return a single value for each group.

The most commonly used SQL aggregate functions are:

MIN() - returns the smallest value within the selected column
MAX() - returns the largest value within the selected column
COUNT() - returns the number of rows in a set
SUM() - returns the total sum of a numerical column
AVG() - returns the average value of a numerical column
Aggregate functions ignore null values (except for COUNT()).

SQL MIN() and MAX() Functions

The SQL MIN() and MAX() Functions
The MIN() function returns the smallest value of the selected column.

The MAX() function returns the largest value of the selected column.

Syntax

SELECT MIN(column_name)
FROM table_name
WHERE condition;

Syntax

SELECT MAX(column_name)
FROM table_name
WHERE condition;

MIN Example

# Find the lowest price in the Price column:

SELECT MIN(Price)
FROM Products;

MAX Example

# Find the highest price in the Price column:

SELECT MAX(Price)
FROM Products;

Set Column Name (Alias)

When you use MIN() or MAX(), the returned column will not have a descriptive name. To give the column a descriptive name, use the AS keyword:

# e.g 

SELECT MIN(Price) AS SmallestPrice
FROM Products;

Use MIN() with GROUP BY

Here we use the MIN() function and the GROUP BY clause, to return the smallest price for each category in the Products table:

# e.g

SELECT MIN(Price) AS SmallestPrice, CategoryID
FROM Products
GROUP BY CategoryID;

SQL COUNT() Function

The COUNT() function returns the number of rows that matches a specified criterion.

# Find the total number of rows in the Products table:

SELECT COUNT(*)
FROM Products;

Syntax

SELECT COUNT(column_name)
FROM table_name
WHERE condition;

Specify Column

You can specify a column name instead of the asterix symbol (*).

If you specify a column name instead of (*), NULL values will not be counted.

# e.g Find the number of products where the ProductName is not null:

SELECT COUNT(ProductName)
FROM Products;

Add a WHERE Clause

You can add a WHERE clause to specify conditions:

# e.g Find the number of products where Price is higher than 20:

SELECT COUNT(ProductID)
FROM Products
WHERE Price > 20;

Ignore Duplicates

You can ignore duplicates by using the DISTINCT keyword in the COUNT() function.

If DISTINCT is specified, rows with the same value for the specified column will be counted as one.

# e.g How many different prices are there in the Products table:

SELECT COUNT(DISTINCT Price)
FROM Products;

Use an Alias

Give the counted column a name by using the AS keyword.

# e.g Name the column "Number of records":

SELECT COUNT(*) AS [Number of records]
FROM Products;

Use COUNT() with GROUP BY

Here we use the COUNT() function and the GROUP BY clause, to return the number of records for each category in the Products table:

# Example

SELECT COUNT(*) AS [Number of records], CategoryID
FROM Products
GROUP BY CategoryID;

The SQL SUM() Function

The SUM() function returns the total sum of a numeric column.

# e.g Return the sum of all Quantity fields in the OrderDetails table:

SELECT SUM(Quantity)
FROM OrderDetails;

Syntax

SELECT SUM(column_name)
FROM table_name
WHERE condition;

Add a WHERE Clause

You can add a WHERE clause to specify conditions:

# e.g Return the sum of the Quantity field for the product with ProductID 11:

SELECT SUM(Quantity)
FROM OrderDetails
WHERE ProductId = 11;

Use an Alias

Give the summarized column a name by using the AS keyword.

# e.g Name the column "total":

SELECT SUM(Quantity) AS total
FROM OrderDetails;

Use SUM() with GROUP BY

Here we use the SUM() function and the GROUP BY clause, to return the Quantity for each OrderID in the OrderDetails table:

# e.g

SELECT OrderID, SUM(Quantity) AS [Total Quantity]
FROM OrderDetails
GROUP BY OrderID;

SUM() With an Expression

The parameter inside the SUM() function can also be an expression.

If we assume that each product in the OrderDetails column costs 10 dollars, we can find the total earnings in dollars by multiply each quantity with 10:

# e.g Use an expression inside the SUM() function:

SELECT SUM(Quantity * 10)
FROM OrderDetails;

We can also join the OrderDetails table to the Products table to find the actual amount, instead of assuming it is 10 dollars:

# e.g Join OrderDetails with Products, and use SUM() to find the total amount:

SELECT SUM(Price * Quantity)
FROM OrderDetails
LEFT JOIN Products 
ON OrderDetails.ProductID = Products.ProductID;

The SQL AVG() Function

The AVG() function returns the average value of a numeric column.

# Find the average price of all products:

SELECT AVG(Price)
FROM Products;

Note: NULL values are ignored.

# Syntax

SELECT AVG(column_name)
FROM table_name
WHERE condition;

Add a WHERE Clause

You can add a WHERE clause to specify conditions:

# e.g Return the average price of products in category 1:

SELECT AVG(Price)
FROM Products
WHERE CategoryID = 1;

Use an Alias

Give the AVG column a name by using the AS keyword.

# e.g Name the column "average price":

SELECT AVG(Price) AS [average price]
FROM Products;

Higher Than Average

To list all records with a higher price than average, we can use the AVG() function in a sub query:

# e.g Return all products with a higher price than the average price:

SELECT * 
FROM Products
WHERE price > (SELECT AVG(price) FROM Products);

Use AVG() with GROUP BY

Here we use the AVG() function and the GROUP BY clause, to return the average price for each category in the Products table:

# e.g

SELECT AVG(Price) AS AveragePrice, CategoryID
FROM Products
GROUP BY CategoryID;

SQL LIKE Operator

The SQL LIKE Operator

The LIKE operator is used in a WHERE clause to search for a specified pattern in a column.

There are two wildcards often used in conjunction with the LIKE operator:

 * The percent sign % represents zero, one, or multiple characters
 * The underscore sign _ represents one, single character

# e.g Select all customers that starts with the letter "a":

SELECT * 
FROM Customers
WHERE CustomerName LIKE 'a%';

Syntax

SELECT column1, column2, ...
FROM table_name
WHERE columnN LIKE pattern;

The _ Wildcard

The _ wildcard represents a single character.

It can be any character or number, but each _ represents one, and only one, character.

# Return all customers from a city that starts with 'L' followed by one wildcard character, then 'nd' and then two wildcard characters:

SELECT * 
FROM Customers
WHERE city LIKE 'L_nd__';

The % Wildcard

The % wildcard represents any number of characters, even zero characters.

# e.g Return all customers from a city that contains the letter 'L':

SELECT * 
FROM Customers
WHERE city LIKE '%L%';

Starts With

To return records that starts with a specific letter or phrase, add the % at the end of the letter or phrase.

# e.g Return all customers that starts with 'La':

SELECT * 
FROM Customers
WHERE CustomerName LIKE 'La%';

* Tip: You can also combine any number of conditions using AND or OR operators.

# e.g Return all customers that starts with 'a' or starts with 'b':

SELECT * 
FROM Customers
WHERE CustomerName LIKE 'a%' OR CustomerName LIKE 'b%';

Ends With

To return records that ends with a specific letter or phrase, add the % at the beginning of the letter or phrase.

# e.g Return all customers that ends with 'a':

SELECT * 
FROM Customers
WHERE CustomerName LIKE '%a';

You can also combine "starts with" and "ends with":

# Return all customers that starts with "b" and ends with "s":

SELECT * 
FROM Customers
WHERE CustomerName LIKE 'b%s';

Contains

To return records that contains a specific letter or phrase, add the % both before and after the letter or phrase.

# e.g Return all customers that contains the phrase 'or'

SELECT * 
FROM Customers
WHERE CustomerName LIKE '%or%';

Combine Wildcards

Any wildcard, like % and _ , can be used in combination with other wildcards.

# e.g Return all customers that starts with "a" and are at least 3 characters in length:

SELECT * 
FROM Customers
WHERE CustomerName LIKE 'a__%';

# e.g Return all customers that have "r" in the second position:

SELECT * 
FROM Customers
WHERE CustomerName LIKE '_r%';

Without Wildcard

If no wildcard is specified, the phrase has to have an exact match to return a result.

# e.g Return all customers from Spain:

SELECT * 
FROM Customers
WHERE Country LIKE 'Spain';

SQL Wildcards

SQL Wildcard Characters

A wildcard character is used to substitute one or more characters in a string.

Wildcard characters are used with the LIKE operator. The LIKE operator is used in a WHERE clause to search for a specified pattern in a column.

# e.g Return all customers that starts with the letter 'a':

SELECT * 
FROM Customers
WHERE CustomerName LIKE 'a%';

Wildcard    Characters

Symbol	    Description
%	        Represents zero or more characters
_	        Represents a single character
[]	        Represents any single character within the brackets
^	        Represents any character not in the brackets
-	        Represents any single character within the specified range
{}	        Represents any escaped character

NOTE =>

* [] ^ and - Not supported in PostgreSQL and MySQL databases.

* {} Supported only in Oracle databases.

 []  Matches any one character within the brackets


SELECT * 
FROM Employees 
WHERE Gender LIKE '[MF]';

* Meaning: Match either 'M' or 'F'.

^  Matches any one character not in the brackets (used inside [])

SELECT * 
FROM Students 
WHERE Grade LIKE '[^A]';

* Meaning: Match grades not starting with 'A'.

- => Specifies a range within brackets

SELECT * 
FROM Files 
WHERE FileName LIKE '[a-z]%';

* Meaning: Match filenames starting with any lowercase letter.

} => Escapes special characters (usually DBMS-specific, e.g., SQL Server)

SELECT * 
FROM Notes 
WHERE Text LIKE '%{_%}%' ESCAPE '{';

* Meaning: Find texts that include the underscore character _ literally.

 Note: {} is specific to SQL Server, and not standard in all SQL databases.

Using the % Wildcard

The % wildcard represents any number of characters, even zero characters.

# e.g Return all customers that ends with the pattern 'es':

SELECT * 
FROM Customers
WHERE CustomerName LIKE '%es';

# Return all customers that contains the pattern 'mer':

SELECT * 
FROM Customers
WHERE CustomerName LIKE '%mer%';

Using the _ Wildcard

The _ wildcard represents a single character.

It can be any character or number, but each _ represents one, and only one, character.

# e.g Return all customers with a City starting with any character, followed by "ondon":

SELECT * 
FROM Customers
WHERE City LIKE '_ondon';

# Return all customers with a City starting with "L", followed by any 3 characters, ending with "on":

SELECT * 
FROM Customers
WHERE City LIKE 'L___on';

Using the [] Wildcard

The [] wildcard returns a result if any of the characters inside gets a match.

# e.g Return all customers starting with either "b", "s", or "p":

SELECT * 
FROM Customers
WHERE CustomerName LIKE '[bsp]%';

Using the - Wildcard

The - wildcard allows you to specify a range of characters inside the [] wildcard.

# e.g Return all customers starting with "a", "b", "c", "d", "e" or "f":

SELECT * 
FROM Customers
WHERE CustomerName LIKE '[a-f]%';

Combine Wildcards

Any wildcard, like % and _ , can be used in combination with other wildcards.

# e.g Return all customers that starts with "a" and are at least 3 characters in length:

SELECT * 
FROM Customers
WHERE CustomerName LIKE 'a__%';

# Return all customers that have "r" in the second position:

SELECT * 
FROM Customers
WHERE CustomerName LIKE '_r%';

Without Wildcard

If no wildcard is specified, the phrase has to have an exact match to return a result.

# e.g Return all customers from Spain:

SELECT * 
FROM Customers
WHERE Country LIKE 'Spain';

Microsoft Access Wildcards
The Microsoft Access Database has some other wildcards:

Symbol	    Description	                                                Example
*	        Represents zero or more characters	                        bl* finds bl, black, blue, and blob
?	        Represents a single character	                            h?t finds hot, hat, and hit
[]	        Represents any single character within the brackets	        h[oa]t finds hot and hat, but not hit
!	        Represents any character not in the brackets	            h[!oa]t finds hit, but not hot and hat
-	        Represents any single character within the specified range	c[a-b]t finds cat and cbt
#	        Represents any single numeric character	                    2#5 finds 205, 215, 225, 235, 245, 255, 265, 275, 285, and 295

Here's a table showing PostgreSQL wildcards along with their symbols and functions:

Wildcard
 
Symbol	    Function
%	        Matches any sequence of zero or more characters.
_	        Matches exactly one character.
[]	        Matches any one character within the brackets (e.g., [aeiou]).
[^]	        Matches any one character NOT within the brackets (e.g., [^aeiou]).
\	        Escape character used to treat a wildcard symbol as a literal character.

 These wildcards are mostly used with the LIKE and ILIKE (case-insensitive LIKE) operators.

# e.g

-- Match any name starting with 'A'
SELECT * 
FROM users 
WHERE name LIKE 'A%';

-- Match any 3-letter word starting with 'b' and ending with 't'
SELECT * 
FROM words 
WHERE word LIKE 'b_t';

-- Match words starting with a vowel
SELECT * 
FROM words 
WHERE word LIKE '[aeiou]%';

-- Match words that do NOT start with a vowel
SELECT * 
FROM words 
WHERE word LIKE '[^aeiou]%';

ILIKE in PostgreSQL is a case-insensitive version of the LIKE operator. 
While LIKE matches patterns case-sensitively, ILIKE allows you to match patterns without regard to case.

The ILIKE operator is not part of the SQL standard, and it is specific to PostgreSQL. 
Most other relational database management systems (RDBMS) do not support ILIKE natively.

In MySQL, LIKE is case-insensitive by default on case-insensitive collation

SELECT * 
FROM table_name 
WHERE column_name ILIKE 'pattern';

Example Comparison:

Assume a table users with a name column.

name
Alice
ALICE
alice
Bob

Using LIKE (case-sensitive):

SELECT * 
FROM users 
WHERE name LIKE 'alice';

 Result: alice only.

Using ILIKE (case-insensitive):

SELECT * 
FROM users 
WHERE name ILIKE 'alice';

 Result: Alice, ALICE, and alice.

Pattern Matching with Wildcards:

You can use wildcards like % and _ with ILIKE, just like with LIKE:

SELECT * 
FROM users 
WHERE name ILIKE 'a%';

 Matches names starting with any variation of "A" (e.g., Alice, ALICE, adam).

 Alternatives to ILIKE in other RDBMS:

-- MySQL / MariaDB (default collation is case-insensitive)
SELECT * 
FROM users 
WHERE name LIKE 'alice';

-- SQL Server
SELECT * 
FROM users 
WHERE LOWER(name) = LOWER('alice');

-- Oracle
SELECT * 
FROM users 
WHERE UPPER(name) = UPPER('alice');

-- SQLite (can be case-insensitive depending on configuration)
SELECT * 
FROM users 
WHERE name LIKE 'alice';

MySQL REGEXP Wildcards (Regular Expressions)

 What is REGEXP?
REGEXP (short for Regular Expression) is a powerful pattern-matching operator in MySQL. It allows you to search for complex string patterns far beyond what LIKE can do.

You can think of it as a smart search tool that understands rules like:

Starts with...

Ends with...

Contains only numbers...

Has exactly 5 characters...

Matches this OR that...

Syntax

SELECT * 

FROM table_name 

WHERE column_name REGEXP 'pattern';

* 'pattern' is the regular expression that contains the wildcards or rules.

* REGEXP is case-sensitive by default. Use LOWER(column) if needed.

Core REGEXP Wildcards and Symbols (With Examples)

Symbol / Pattern	    Meaning	                                Example Query	                                        Matches	Explanation
.	                    Any single character	                SELECT * FROM users WHERE name REGEXP '^A'.c';	        Alice, Alec	Matches names that start with A, followed by any character, then 'c'

*	                    0 or more of the previous character	    SELECT * FROM users WHERE name REGEXP 'Bo*b';	        Bb, Bob, Boob	Matches "B", optionally followed by many 'o', then 'b'

+	                    1 or more of the previous character	    SELECT * FROM users WHERE name REGEXP 'Bo+b';	        Bob, Boob	Same as above, but requires at least one 'o'

?	                    0 or 1 of the previous character	    SELECT * FROM users WHERE name REGEXP 'Ali?ce';	        Alice, Alce	The 'i' is optional

^	                    Start of string	                        SELECT * FROM users WHERE name REGEXP '^A';	            Alice, Alan	Names starting with A

$	                    End of string	                        SELECT * FROM users WHERE name REGEXP 'a$';	            Diana, Carla	Names ending in 'a'

[abc]	                Any one of a, b, or c	                SELECT * FROM users WHERE name REGEXP '^[abc]';	        Alice, Bob, Carla	Names starting with a, b, or c

[^abc]	                Not a, b, or c	                        SELECT * FROM users WHERE name REGEXP '^[^abc]';	    Diana, 123	Names not starting with a, b, or c

[a-z]	                Any lowercase letter	                SELECT * FROM users WHERE name REGEXP '^[a-z]';	        alex, dog	Lowercase-starting names

[A-Z]	                Any uppercase letter	                SELECT * FROM users WHERE name REGEXP '^[A-Z]';	        Alice, Bob	Uppercase-starting names

[0-9]	                Any digit	                            SELECT * FROM users WHERE name REGEXP '^[0-9]';	        123, 4567	Names that start with a number

`	`	                OR between patterns	                    `SELECT * FROM users WHERE name REGEXP 'cat	dog';`

()                  	Grouping expressions	                `SELECT * FROM users WHERE name REGEXP '^(A	B).*';`	    Alice, Bob

{n}	                    Exactly n repetitions	                SELECT * FROM users WHERE name REGEXP '^.{5}$';	        Alice, Diana	Names with exactly 5 characters

{n,}	                n or more repetitions	                SELECT * FROM users WHERE name REGEXP '^[0-9]{3,}$';	123, 4567	Numbers with 3 or more digits

{n,m}	                Between n and m repetitions	            SELECT * FROM users WHERE name REGEXP '^[0-9]{2,4}$';	123, 4567	Numbers with 24 digits

 Scenario 1: Filtering Names that Start with A

SELECT * 
FROM users 
WHERE name REGEXP '^A';

* Result: Alice, Alan, Amanda

* Why: The ^ ensures the name starts with A.

 Scenario 2: Names That End with a

SELECT * 
FROM users 
WHERE name REGEXP 'a$';

* Result: Amanda, Carla, Diana

* Why: The $ ensures it ends with a.

 Scenario 3: Names Containing Either cat or dog

SELECT * 
FROM users 
WHERE name REGEXP 'cat|dog';

* Result: cat, dog, catalog

* Why: The pipe | acts as an OR condition.

 Scenario 4: Names of Exactly 4 Characters

SELECT * 
FROM users 
WHERE name REGEXP '^.{4}$';

* Result: Alan, John

* Why: . means any character, {4} means exactly 4 times.

 Scenario 5: Names with Only Digits (e.g., '123')

SELECT * 
FROM users 
WHERE name REGEXP '^[0-9]+$';

* Result: 123, 4567

* Why: The range [0-9] checks digits, + allows 1 or more.

 Scenario 6: Names with Double Letters (e.g., 'oo', 'll')

SELECT * 
FROM users 
WHERE name REGEXP '(.)\\1';

* Matches: Bobby, Aaron, Ella

* Explanation: (.)\\1 captures a character and matches it again. It finds any repeated character.

 Scenario 7: Names Starting with a Vowel

SELECT * 
FROM users 
WHERE name REGEXP '^[aeiouAEIOU]';

* Matches: Alice, Aaron, Amanda, Ella

* Explanation: ^[aeiouAEIOU] checks if the first character is a vowel (case-insensitive).

 Scenario 8: Names Containing Only Letters

SELECT * 
FROM users 
WHERE name REGEXP '^[A-Za-z]+$';

* Matches: Alice, Bob, Carla, Diana

* Explanation: Ensures the name has only letters and no numbers/symbols.

 Scenario 9: Names That Contain Numbers

SELECT * 
FROM users 
WHERE name REGEXP '[0-9]';

* Matches: user1, john23, Alex007

* Explanation: Matches any name that contains at least one digit.

 Scenario 10: Names Ending with 'y' or 'e'

SELECT * 
FROM users 
WHERE name REGEXP '[ye]$';

* Matches: Bobby, Alice

* Explanation: The pattern looks for names ending in either y or e.

 Scenario 11: Names with At Least One Uppercase Letter

SELECT * 
FROM users 
WHERE name REGEXP '[A-Z]';

* Matches: Alice, Bob, Amanda

* Explanation: Checks if any character in the name is an uppercase letter.

 Scenario 12: Names Containing Exactly 3 Letters

SELECT * 
FROM users 
WHERE name REGEXP '^.{3}$';

* Matches: Bob, Sam, Max

* Explanation: ^.{3}$ ensures the name has exactly 3 characters.

 Scenario 13: Names That Start and End with the Same Letter

SELECT * 
FROM users 
WHERE name REGEXP '^(.).*\1$';

* Matches: Anna, Aaron (if ends in 'A'), Otto

* Explanation: Captures the first character and matches it at the end.

 Scenario 14: Names with 2 to 5 Characters Only

SELECT * 
FROM users 
WHERE name REGEXP '^.{2,5}$';

* Matches: Bob, Alan, Carla

* Explanation: Matches names with a length of 2 to 5 characters.

 Scenario 15: Names That Contain the Word man

SELECT * 
FROM users 
WHERE name REGEXP 'man';

* Matches: Amanda, Emmanuel, Manfred

* Explanation: Finds any name that includes the sequence man.

Common Mistakes to Watch For

Mistake	                                    What Happens	                                Fix

Forgetting ^ or $	                        Matches anywhere instead of start/end	        Add anchors

Using * without context	                    Unexpected matches	                            Use * after a defined character

Confusing [abc] with (abc)	                Wrong match range	                            Use brackets for character sets

Assuming case-insensitive by default	    Doesnt match lowercase/uppercase variants	    Use LOWER(column) or BINARY comparison

SQL JOIN

A JOIN clause is used to combine rows from two or more tables, based on a related column between them.

Different Types of SQL JOINs

Here are the different types of the JOINs in SQL:

* (INNER) JOIN: Returns records that have matching values in both tables

* LEFT (OUTER) JOIN: Returns all records from the left table, and the matched records from the right table

* RIGHT (OUTER) JOIN: Returns all records from the right table, and the matched records from the left table

* FULL (OUTER) JOIN: Returns all records when there is a match in either left or right table

SQL INNER JOIN

INNER JOIN

The INNER JOIN keyword selects records that have matching values in both tables.

# ExampleGet your own SQL Server

# Join Products and Categories with the INNER JOIN keyword:

SELECT ProductID, ProductName, CategoryName
FROM Products
INNER JOIN Categories
 ON Products.CategoryID = Categories.CategoryID;

Note: The INNER JOIN keyword returns only rows with a match in both tables. 

Which means that if you have a product with no CategoryID, or with a CategoryID that is not present in the Categories table, that record would not be returned in the result.

Syntax

SELECT column_name(s)

FROM table1

INNER JOIN table2

ON table1.column_name = table2.column_name;

Naming the Columns

It is a good practice to include the table name when specifying columns in the SQL statement.

<!-- Example

Specify the table names: -->

SELECT Products.ProductID, Products.ProductName, Categories.CategoryName

FROM Products

INNER JOIN Categories ON Products.CategoryID = Categories.CategoryID;